app/controllers/movies_controller.rb

  def index
#    @movies = Movie.find(:all).sort { |a,b| a.released_on <=> b.released_on }
#     @movies = Movie.all
    @movies_ratings = Movie.ratings.sort
    session[:sort_by] ||= 'title'
    session[:ratings] ||= @movies_ratings
    session[:sort_by] = (params[:sort].blank? ? session[:sort_by] : params[:sort])

    session[:ratings] = (params[:ratings].blank? ? session[:ratings] : params[:ratings].keys)
    @movies = Movie.where(:rating => session[:ratings]).order("#{session[:sort_by]} ASC")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY # {session[:sort_by]} ASC